"""
7. Написати скрипт, який отримає максимальне і мінімальне значення із словника. Дані захардкодити.
                Приклад словника (можете використовувати свій):
                dict_1 = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}
                Вихідний результат:
                MIN: 10
                MAX: 60
"""

d = {1: 10, 2: 20, 'd': 30, 4: 40, 5: 50, 6: 60}

lower = list(d.items())[0][1]
higher = list(d.items())[0][1]

for i in d:
    if d[i] > higher:
        higher = d[i]
    if d[i] < lower:
        lower = d[i]

print('MAX =', higher)
print('MIN =', lower)
