"""
2. Написати функцію < bank > , яка працює за наступною логікою: користувач робить вклад у розмірі < a > одиниць строком на < years > років під < percents > відсотків (кожен рік сума вкладу збільшується на цей відсоток, ці гроші додаються до суми вкладу і в наступному році на них також нараховуються відсотки). Параметр < percents > є необов'язковим і має значення по замовчуванню < 10 > (10%). Функція повинна принтануть і вернуть суму, яка буде на рахунку.
"""

def bank(a, y, p = 10):
    for i in range(int(y)):
        a += a * (p / 100)
    print(a)
    return a

inp = list(map(float, input().split()))

if len(inp) == 2:
    p = 10
else:
    p = inp[2]
a = inp[0]
y = inp[1]

bank(a, y, p)
